## MySQL on Local Machine(Mysql Workbench)

### Student Database

In [51]:
"""
Code Challenge 1
Write a python code to insert records to a mysql
named db_University for 10 students with fields like 
Student_Name, Student_Age, Student_Roll_no, Student_Branch.

"""

from pandas import DataFrame
import mysql.connector

## data of students
branch= ['CSE','ECE','EE','ME','CE']
St_Name= ['suraj','rajesh','sandeep','yogendra','ravi','mohit','kamesh','dinesh','rishabh','nimesh']
St_Age= [25, 21, 22, 20, 21, 22, 20, 20, 22, 23]
St_Roll_no= [11, 22, 12, 21, 24, 6, 6, 25, 16, 22]
St_Branch= ['CSE', 'CE', 'ME', 'CSE', 'ME', 'ECE', 'EE', 'CSE', 'CE', 'CSE']

# File based database ( connects if exists or creates a new one if it does not exists ) 
conn = mysql.connector.connect ( host='localhost', user='root', passwd='surya321' )
# database = '' can be used if we want to connect to already defined database

# creating cursor
c = conn.cursor()

In [2]:
c.execute("show databases")  # command to show all databases
for i in c:
    print(i)

('db_university',)
('employee',)
('employeedb',)
('icc_db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [3]:
## STEP 0 if exists
c.execute("DROP DATABASE IF EXISTS db_University;")
conn.commit()

In [4]:
c.execute("show databases")
for i in c:
    print(i)

('employee',)
('employeedb',)
('icc_db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [5]:

# STEP 1
c.execute("CREATE DATABASE db_University;")
conn.commit()

# STEP 2
c.execute("USE db_University;")
conn.commit()

# STEP 3
c.execute ("""CREATE TABLE student(
          id INTEGER,
          rollno INTEGER,
          name TEXT, 
          age INTEGER,
          branch TEXT
          )"""
          )
conn.commit()


# STEP 4
# c.execute("INSERT INTO student VALUES ({},'{}', '{}', {})".format(idd, first,last,pay))

for i in range(10):
    query= "INSERT INTO student VALUES ({},{},'{}',{},'{}')".format(i+1, St_Roll_no[i], St_Name[i], St_Age[i], St_Branch[i]  ) 
    c.execute(query)

conn.commit()    ## do commit only when we create and insert values in table

In [6]:

c.execute("SELECT * FROM student;")

# STEP 5
# returns one or otherwise None as a tuple
print ( c.fetchone(),'\n') 

# returns a list of tuples
print ( c.fetchall() )

# Since now the cursor has read all the rows and we are at End
# So again fetching the records from the database
c.execute("SELECT * FROM student;")


# STEP 6
df = DataFrame(c.fetchall(), columns = ["id","Roll No","Name","Age","Branch"])  # putting the result into Dataframe
print(df)
# field_names = [i[0] for i in c.description]
# print field_names

conn.close()

(1, 11, 'suraj', 25, 'CSE')

[(2, 22, 'rajesh', 21, 'CE'), (3, 12, 'sandeep', 22, 'ME'), (4, 21, 'yogendra', 20, 'CSE'), (5, 24, 'ravi', 21, 'ME'), (6, 6, 'mohit', 22, 'ECE'), (7, 6, 'kamesh', 20, 'EE'), (8, 25, 'dinesh', 20, 'CSE'), (9, 16, 'rishabh', 22, 'CE'), (10, 22, 'nimesh', 23, 'CSE')]
   id  Roll No      Name  Age Branch
0   1       11     suraj   25    CSE
1   2       22    rajesh   21     CE
2   3       12   sandeep   22     ME
3   4       21  yogendra   20    CSE
4   5       24      ravi   21     ME
5   6        6     mohit   22    ECE
6   7        6    kamesh   20     EE
7   8       25    dinesh   20    CSE
8   9       16   rishabh   22     CE
9  10       22    nimesh   23    CSE

## Inserting Pandas DataFrames Into Mysql Database using 'to_sql' function

In [17]:
import pandas as pd
import mysql.connector

## Read csv file
df = pd.read_csv("Saved csv/icc_odi.csv")   
df= df.iloc[:,1:]
print(df)

    Rank              Team  Weighted Matches Points  Rating
0      1           England                56  6,967     124
1      2             India                67  7,939     118
2      3       New Zealand                46  5,347     116
3      4      South Africa                50  5,602     112
4      5         Australia                54  5,915     110
5      6          Pakistan                51  5,019      98
6      7        Bangladesh                47  4,059      86
7      8         Sri Lanka                59  4,910      83
8      9       West Indies                61  4,767      78
9     10       Afghanistan                43  2,440      57
10    11           Ireland                31  1,525      49
11    12          Zimbabwe                36  1,572      44
12    13       Netherlands                 6    222      37
13    14              Oman                14    479      34
14    15          Scotland                18    537      30
15    16             Nepal                12    237      20
16    17           Namibia                11    177      16
17    18               UAE                21    285      14
18    19     United States                16    185      12
19    20  Papua New Guinea                17      0       0

In [19]:
# Import dataframe into MySQL
import sqlalchemy

# create sqlalchemy engine
engine = sqlalchemy.create_engine("mysql+mysqlconnector://{user}:{pw}@localhost/{db}"
                           .format(user="root",
                                   pw="surya321",
                                   db="icc_db"))

In [20]:
## There is no need to create table,table will be created from the dataframe itself.
## whenever used 'to_sql' function.
df.to_sql(con=engine, name='odi', if_exists='replace', index= False)

## Inserting new dataframe

In [9]:
## Read csv file
df = pd.read_csv("Saved csv/icc_t20.csv")   
df= df.iloc[:,1:]
print(df)

    Rank          Team  Weighted Matches  Points  Rating
0      1      Pakistan                33   8,926     270
1      2     Australia                29   7,815     269
2      3       England                24   6,407     267
3      4         India                46  12,141     264
4      5  South Africa                24   6,220     259
..   ...           ...               ...     ...     ...
82    83        Rwanda                 6       0       0
83    84     Swaziland                 6       0       0
84    85        Gambia                 6       0       0
85    86         China                11       0       0
86    87        Turkey                 6       0       0

[87 rows x 5 columns]

In [ ]:
# Import dataframe into MySQL
import sqlalchemy

# create sqlalchemy engine
engine = sqlalchemy.create_engine("mysql+mysqlconnector://{user}:{pw}@localhost/{db}"
                           .format(user="root",
                                   pw="surya321",
                                   db="icc_db"))

In [12]:
df.to_sql(con=engine, name='t20', if_exists='replace', index= False)

## Reading Records from the Database

In [22]:
import pandas as pd
import mysql.connector

# File based database ( connects if exists or creates a new one if it does not exists ) 
# database = '' can be used if we want to connect to already defined database
conn = mysql.connector.connect ( host='localhost', user='root', passwd='surya321',db="icc_db" )

# creating cursor
c = conn.cursor()

In [23]:
# Execute Query
c.execute("SELECT * from odi")

# Fetch the records
result = c.fetchall()

for i in result:
    print(i)

(1, 'England', 56, '6,967', 124)
(2, 'India', 67, '7,939', 118)
(3, 'New Zealand', 46, '5,347', 116)
(4, 'South Africa', 50, '5,602', 112)
(5, 'Australia', 54, '5,915', 110)
(6, 'Pakistan', 51, '5,019', 98)
(7, 'Bangladesh', 47, '4,059', 86)
(8, 'Sri Lanka', 59, '4,910', 83)
(9, 'West Indies', 61, '4,767', 78)
(10, 'Afghanistan', 43, '2,440', 57)
(11, 'Ireland', 31, '1,525', 49)
(12, 'Zimbabwe', 36, '1,572', 44)
(13, 'Netherlands', 6, '222', 37)
(14, 'Oman', 14, '479', 34)
(15, 'Scotland', 18, '537', 30)
(16, 'Nepal', 12, '237', 20)
(17, 'Namibia', 11, '177', 16)
(18, 'UAE', 21, '285', 14)
(19, 'United States', 16, '185', 12)
(20, 'Papua New Guinea', 17, '0', 0)

In [24]:
# Execute Query
c.execute("SELECT * from t20")

# Fetch the records
result = c.fetchall()

for i in result:
    print(i)

(1, 'Pakistan', 33, '8,926', 270)
(2, 'Australia', 29, '7,815', 269)
(3, 'England', 24, '6,407', 267)
(4, 'India', 46, '12,141', 264)
(5, 'South Africa', 24, '6,220', 259)
(6, 'New Zealand', 29, '7,114', 245)
(7, 'Afghanistan', 23, '5,422', 236)
(8, 'Sri Lanka', 29, '6,830', 236)
(9, 'Bangladesh', 25, '5,645', 226)
(10, 'West Indies', 32, '7,129', 223)
(11, 'Zimbabwe', 21, '4,082', 194)
(12, 'Scotland', 23, '4,310', 187)
(13, 'Ireland', 38, '7,076', 186)
(14, 'UAE', 31, '5,754', 186)
(15, 'Nepal', 26, '4,802', 185)
(16, 'Netherlands', 31, '5,547', 179)
(17, 'Papua New Guinea', 30, '5,277', 176)
(18, 'Oman', 21, '3,645', 174)
(19, 'Namibia', 25, '3,829', 153)
(20, 'Singapore', 23, '3,098', 135)
(21, 'Hong Kong', 25, '3,164', 127)
(22, 'Canada', 19, '2,399', 126)
(23, 'Qatar', 28, '3,411', 122)
(24, 'Saudi Arabia', 14, '1,616', 115)
(25, 'Jersey', 25, '2,848', 114)
(26, 'Italy', 12, '1,326', 111)
(27, 'Kuwait', 18, '1,960', 109)
(28, 'Kenya', 18, '1,952', 108)
(29, 'Denmark', 14, '1,438', 103)
(30, 'Bermuda', 13, '1,202', 92)
(31, 'Malaysia', 33, '2,866', 87)
(32, 'Germany', 18, '1,527', 85)
(33, 'United States', 15, '1,208', 81)
(34, 'Botswana', 19, '1,494', 79)
(35, 'Ghana', 10, '773', 77)
(36, 'Uganda', 17, '1,291', 76)
(37, 'Norway', 10, '709', 71)
(38, 'Guernsey', 16, '1,127', 70)
(39, 'Austria', 11, '772', 70)
(40, 'Nigeria', 16, '1,058', 66)
(41, 'Romania', 8, '495', 62)
(42, 'Sweden', 8, '465', 58)
(43, 'Tanzania', 6, '334', 56)
(44, 'Spain', 16, '873', 55)
(45, 'Cayman Islands', 8, '430', 54)
(46, 'Philippines', 9, '433', 48)
(47, 'Bahrain', 11, '518', 47)
(48, 'Argentina', 17, '771', 45)
(49, 'France', 6, '267', 45)
(50, 'Vanuatu', 20, '869', 43)
(51, 'Belize', 9, '377', 42)
(52, 'Luxembourg', 10, '394', 39)
(53, 'Peru', 13, '458', 35)
(54, 'Fiji', 6, '210', 35)
(55, 'Malawi', 18, '624', 35)
(56, 'Panama', 9, '291', 32)
(57, 'Belgium', 9, '290', 32)
(58, 'Samoa', 10, '318', 32)
(59, 'Japan', 10, '317', 32)
(60, 'Costa Rica', 8, '252', 32)
(61, 'Mexico', 17, '520', 31)
(62, 'Hungary', 6, '180', 30)
(63, 'Bulgaria', 8, '231', 29)
(64, 'Czech Republic', 17, '478', 28)
(65, 'Thailand', 16, '401', 25)
(66, 'Israel', 7, '173', 25)
(67, 'Portugal', 9, '215', 24)
(68, 'Finland', 13, '296', 23)
(69, 'South Korea', 10, '217', 22)
(70, 'Isle of Man', 7, '149', 21)
(71, 'Mozambique', 18, '349', 19)
(72, 'Chile', 14, '265', 19)
(73, 'Bhutan', 10, '153', 15)
(74, 'Sierra Leone', 5, '61', 12)
(75, 'Brazil', 13, '143', 11)
(76, 'Maldives', 17, '180', 11)
(77, 'Saint Helena', 12, '109', 9)
(78, 'Malta', 13, '108', 8)
(79, 'Myanmar', 9, '23', 3)
(80, 'Indonesia', 7, '3', 0)
(81, 'Gibraltar', 12, '0', 0)
(82, 'Lesotho', 6, '0', 0)
(83, 'Rwanda', 6, '0', 0)
(84, 'Swaziland', 6, '0', 0)
(85, 'Gambia', 6, '0', 0)
(86, 'China', 11, '0', 0)
(87, 'Turkey', 6, '0', 0)

In [25]:
c.execute("show databases")  # command to show all databases
for i in c:
    print(i)

('db_university',)
('employee',)
('employeedb',)
('icc_db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [54]:
## STEP 0 if exists
c.execute("DROP DATABASE IF EXISTS icc_db;")
conn.commit()

In [ ]:
# STEP 1
c.execute("CREATE DATABASE icc_db;")
conn.commit()

In [63]:
# STEP 2
c.execute("USE icc_db;")
conn.commit()

In [5]:
c.execute("DROP TABLE student")
conn.commit()

In [26]:
c.execute("SHOW TABLES")
for table in c:
    print(table)

('odi',)
('t20',)

In [60]:
conn.close()